; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	infrared3 - mode
	thermograph2 - mode
	thermograph0 - mode
	infrared1 - mode
	GroundStation7 - direction
	Star9 - direction
	GroundStation13 - direction
	GroundStation1 - direction
	Star14 - direction
	Star8 - direction
	GroundStation11 - direction
	Star0 - direction
	Star3 - direction
	GroundStation6 - direction
	GroundStation12 - direction
	Star4 - direction
	Star2 - direction
	Star10 - direction
	GroundStation5 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Phenomenon19 - direction
	Phenomenon20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 GroundStation13)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star14)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation11)
	(supports instrument5 infrared3)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation11)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 Star10)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument6 thermograph0)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 Star3)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 Star0)
	(supports instrument7 thermograph0)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 Star4)
	(calibration_target instrument7 GroundStation12)
	(supports instrument8 infrared1)
	(calibration_target instrument8 GroundStation5)
	(calibration_target instrument8 Star10)
	(calibration_target instrument8 Star2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation5)
)
(:goal (and
	(have_image Star15 thermograph2)
	(have_image Phenomenon17 thermograph2)
	(have_image Phenomenon18 infrared3)
	(have_image Phenomenon19 infrared3)
	(have_image Star21 thermograph2)
))

)

; plan
1. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 0 of 5
2. (calibrate satellite1 instrument5 groundstation5)
   added: (calibrated instrument5)
   goals met: 0 of 5
3. (turn_to satellite1 phenomenon19 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 phenomenon19)
   goals met: 0 of 5
4. (take_image satellite1 phenomenon19 instrument5 infrared3)
   added: (have_image phenomenon19 infrared3)
   goals met: 1 of 5
5. (turn_to satellite1 phenomenon18 phenomenon19)
   deleted: (pointing satellite1 phenomenon19)
   added: (pointing satellite1 phenomenon18)
   goals met: 1 of 5
6. (take_image satellite1 phenomenon18 instrument5 infrared3)
   added: (have_image phenomenon18 infrared3)
   goals met: 2 of 5
7. (turn_to satellite1 phenomenon17 phenomenon18)
   deleted: (pointing satellite1 phenomenon18)
   added: (pointing satellite1 phenomenon17)
   goals met: 2 of 5
8. (take_image satellite1 phenomenon17 instrument5 thermograph2)
   added: (have_image phenomenon17 thermograph2)
   goals met: 3 of 5
9. (turn_to satellite1 star15 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 star15)
   goals met: 3 of 5
10. (take_image satellite1 star15 instrument5 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 4 of 5
11. (turn_to satellite1 star21 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star21)
   goals met: 4 of 5
12. (take_image satellite1 star21 instrument5 thermograph2)
   added: (have_image star21 thermograph2)
   goals met: 5 of 5
